{"Lithium Carbonate": "Lithium carbonate is an inorganic compound, the lithium salt of carbonate with the formula Li\n2CO\n3. This white salt is widely used in the processing of metal oxides.\nFor the treatment of bipolar disorder, it is on the World Health Organization's List of Essential Medicines, the most important medications needed in a basic health system.", "Magnesium Carbonate": "Magnesium carbonate, MgCO3 (archaic name magnesia alba), is an inorganic salt that is a white solid. Several hydrated and basic forms of magnesium carbonate also exist as minerals.", "Ammonium Phosphate": "Ammonium phosphate is the salt of ammonium and phosphate. It is a highly unstable compound with the formula (NH4)3PO4. Because of its instability, it is elusive and of no commercial value (except for scientific research). In addition to (NH4)3PO4, a related double salt (NH4)2HPO4 is also recognized. It too is unstable. The instability of these salts results in their facile decomposition with evolution of ammonia:\n(NH4)3PO4 → (NH4)2HPO4 + NH3\nIn contrast to the fragile nature of the triammonium salts, diammonium phosphate (NH4)2HPO4 is a valuable material, mainly used as a fertilizer.", "Magnesium Hydroxide": "Magnesium hydroxide is the inorganic compound with the chemical formula Mg(OH)2. It occurs in nature as the mineral brucite. It is a white solid with low solubility in water (Ksp = 5.61×10−12, Magnesium hydroxide is a common component of antacids, such as milk of magnesia, as well as laxatives.", "Zinc Chloride": "Zinc chloride is the name of chemical compounds with the formula ZnCl2 and its hydrates. Zinc chlorides, of which nine crystalline forms are known, are colorless or white, and are highly soluble in water. ZnCl2 itself is hygroscopic and even deliquescent. Samples should therefore be protected from sources of moisture, including the water vapor present in ambient air. Zinc chloride finds wide application in textile processing, metallurgical fluxes, and chemical synthesis. No mineral with this chemical composition is known aside from the very rare mineral simonkolleite, Zn5(OH)8Cl2·H2O.", "Ammonium Carbonate": "Ammonium carbonate is a salt with the chemical formula (NH4)2CO3. Since it readily degrades to gaseous ammonia and carbon dioxide upon heating, it is used as a leavening agent and also as smelling salt. It is also known as baker's ammonia and was a predecessor to the more modern leavening agents baking soda and baking powder. It is a component of what was formerly known as sal volatile and salt of hartshorn.", "Hydrogen Hydroxide": "Hydrogen hydroxide is not a naturally occuring compound. Theoretically, it is formed when 1 hydrogen ion combines with 1 hydroxide ion.", "Hydrogen Nitride": "Hydrogen nitride is not a naturally occuring compound. Theoretically, it is formed when 3 hydrogen ions combine with 1 nitride ion.", "Aluminium Phosphate": "Aluminium phosphate (AlPO4) is a chemical compound. The anhydrous form is found in nature as the mineral berlinite. Many synthetic forms of anhydrous aluminium phosphate are known. They have framework structures similar to zeolites and some are used as catalysts or molecular sieves. The dihydrate, AlPO4·2H2O is found as the minerals variscite and meta-variscite. A synthetic hydrated form, AlPO4·1.5H2O is also known. Commercially, an aluminium phosphate gel is available.", "Zinc Carbonate": "Smithsonite, or zinc spar, is zinc carbonate (ZnCO3), a mineral ore of zinc. Historically, smithsonite was identified with hemimorphite before it was realised that they were two distinct minerals. The two minerals are very similar in appearance and the term calamine has been used for both, leading to some confusion. The distinct mineral smithsonite was named in 1832 by François Sulpice Beudant in honor of English chemist and mineralogist James Smithson (c.1765–1829), whose bequest established the Smithsonian Institution and who first identified the mineral in 1802.\nSmithsonite is a variably colored trigonal mineral which only rarely is found in well formed crystals. The typical habit is as earthy botryoidal masses. It has a Mohs hardness of 4.5 and a specific gravity of 4.4 to 4.5.\nSmithsonite occurs as a secondary mineral in the weathering or oxidation zone of zinc-bearing ore deposits. It sometimes occurs as replacement bodies in carbonate rocks and as such may constitute zinc ore. It commonly occurs in association with hemimorphite, willemite, hydrozincite, cerussite, malachite, azurite, aurichalcite and anglesite. It forms two limited solid solution series, with substitution of manganese leading to rhodochrosite, and with iron, leading to siderite.", "Aluminium Nitride": "Aluminium nitride (AlN) is a nitride of aluminium. Its wurtzite phase (w-AlN) is a wide band gap (6.01-6.05 eV at room temperature) semiconductor material, giving it potential application for deep ultraviolet optoelectronics.", "Zinc Hydroxide": "Zinc hydroxide Zn(OH)2 is an inorganic chemical compound. It also occurs naturally as 3 rare minerals: wülfingite (orthorhombic), ashoverite and sweetite (both tetragonal).\nLike the hydroxides of other metals, such as lead, aluminium, beryllium, tin and chromium, zinc hydroxide (and zinc oxide), is amphoteric. Thus it will dissolve readily in a dilute solution of a strong acid, such as HCl, and also in a solution of an alkali such as sodium hydroxide.\nIt can be prepared by adding sodium hydroxide solution, but not in excess, to a solution of any zinc salt. A white precipitate will be seen:\nZn2+ + 2 OH− → Zn(OH)2.\nZn2+ is known to form hexa-aqua ions at high water concentrations and tetra-aqua ions at low concentrations of water  and, thus, this reaction may be better written as the reaction of the aquated ion with hydroxide through donation of a proton, as follows.\nZn2+(OH2)4(aq) + OH−(aq) → Zn2+(OH2)3OH−(aq) + H2O(l)\nSubsequent reactions discussed below can also, therefore, be considered as reactions with the aquated zinc ion and one can adjust them accordingly. However, for simplicity, the water molecules are omitted from here-on.\nIf excess sodium hydroxide is added, the precipitate of zinc hydroxide will dissolve, forming a colorless solution of zincate ion:\nZn(OH)2 + 2 OH− → Zn(OH)42−.\nThis property can be used as a test for zinc ions in solution, but it is not exclusive, since aluminum and lead compounds behave in a very similar manner. Unlike the hydroxides of aluminum and lead, zinc hydroxide also dissolves in excess aqueous ammonia to form a colorless, water-soluble ammine complex.\nZinc hydroxide will dissolve because the ion is normally surrounded by water ligands; when excess sodium hydroxide is added to the solution the hydroxide ions will reduce the complex to a −2 charge and make it soluble. When excess ammonia is added, it sets up an equilibrium which provides hydroxide ions; the formation of hydroxide ions causes a similar reaction as sodium hydroxide and creates a +2 charged complex with a co-ordination number of 4 with the ammonia ligands - this makes the complex soluble so that it dissolves.\nOne major use is as an absorbent in surgical dressings.", "Sodium Bromide": "Sodium bromide is an inorganic compound with the formula NaBr. It is a high-melting white, crystalline solid that resembles sodium chloride. It is a widely used source of the bromide ion and has many applications.", "Hydrogen Sulfate": "Hydrogen sulfate is not a naturally occuring compound. Theoretically, it is formed when 2 hydrogen ions combine with 1 sulfate ion.", "Hydrogen Bromide": "Hydrogen bromide is the diatomic molecule with the formula HBr. It is a colorless compound and a hydrogen halide. Hydrobromic acid is a solution of HBr in water. Both the anhydrous and aqueous solutions of HBr are common reagents in the preparation of bromide compounds.\nHBr is very soluble in water, forming hydrobromic acid solution, which is saturated at 68.85% HBr by weight at room temperature. Aqueous solutions that are 47.6% HBr by weight form a constant-boiling azeotrope mixture that boils at 124.3 °C. Boiling less concentrated solutions releases H2O until the constant boiling mixture composition is reached.", "Calcium Phosphate": "Calcium phosphate is the name given to a family of materials and minerals containing calcium ions (Ca2+) together with inorganic phosphate anions. Some so-called calcium phosphates contain oxide and hydroxide as well. They are white solids of nutritious value.", "Magnesium Fluoride": "Magnesium fluoride is an inorganic compound with the formula MgF2. The compound is a white crystalline salt and is transparent over a wide range of wavelengths, with commercial uses in optics that are also used in space telescopes. It occurs naturally as the rare mineral sellaite.", "Magnesium Sulfate": "Magnesium sulfate is an inorganic salt (chemical compound) containing magnesium, sulfur and oxygen, with the formula MgSO4. It is often encountered as the heptahydrate sulfate mineral epsomite (MgSO4·7H2O), commonly called Epsom salt. The monohydrate, MgSO4·H2O is found as the mineral kieserite. The overall global annual usage in the mid-1970s of the monohydrate was 2.3 million tons, of which the majority was used in agriculture.\nAnhydrous magnesium sulfate is used as a drying agent. The anhydrous form is hygroscopic (readily absorbs water from the air) and is therefore difficult to weigh accurately; the hydrate is often preferred when preparing solutions (for example, in medical preparations). Epsom salt has been traditionally used as a component of bath salts. Epsom salt can also be used as a beauty product. Athletes use it to soothe sore muscles, while gardeners use it to improve crops. It has a variety of other uses: for example, Epsom salt is also effective in the removal of splinters.\nIt is on the WHO Model List of Essential Medicines, the most important medications needed in a basic health system.", "Calcium Bromide": "Calcium bromide is the name for compounds with the chemical formula CaBr2(H2O)x. Individual compounds include the anhydrous material (x = 0), the hexahydrate (x = 6), and the rare dihydrate (x= 2). All are white powders that dissolve in water, and from these solutions crystallizes the hexahydrate. The hydrated form is mainly used in some drilling fluids.", "Ammonium Bromide": "Ammonium bromide, NH4Br, is the ammonium salt of hydrobromic acid. The chemical crystallizes in colorless prisms, possessing a saline taste; it sublimes on heating and is easily soluble in water. On exposure to air it gradually assumes a yellow color because of the oxidation of traces of bromide (Br−) to bromine (Br2).", "Hydrogen Chloride": "The compound hydrogen chloride has the chemical formula HCl and as such is a hydrogen halide. At room temperature, it is a colorless gas, which forms white fumes of hydrochloric acid upon contact with atmospheric humidity. Hydrogen chloride gas and hydrochloric acid are important in technology and industry. Hydrochloric acid, the aqueous solution of hydrogen chloride, is also commonly given the formula HCl.", "Sodium Hydride": "Sodium hydride is the chemical compound with the empirical formula NaH. This alkali metal hydride is primarily used as a strong, yet combustible base in organic synthesis. NaH is representative of the saline hydrides, meaning it is a salt-like hydride, composed of Na+ and H− ions, in contrast to the more molecular hydrides such as borane, methane, ammonia and water. It is an ionic material that is insoluble in organic solvents (although soluble in molten Na), consistent with the fact that H− remains an unknown anion in solution. Because of the insolubility of NaH, all reactions involving NaH occur at the surface of the solid.", "Hydrogen Carbonate": "In inorganic chemistry, bicarbonate (IUPAC-recommended nomenclature: hydrogen carbonate) is an intermediate form in the deprotonation of carbonic acid. It is a polyatomic anion with the chemical formula HCO−\n3.\nBicarbonate serves a crucial biochemical role in the physiological pH buffering system.\nThe term \"bicarbonate\" was coined in 1814 by the English chemist William Hyde Wollaston. The prefix \"bi\" in \"bicarbonate\" comes from an outdated naming system and is based on the observation that there is twice as much carbonate (CO2−\n3) per sodium ion in sodium bicarbonate (NaHCO3) and other bicarbonates than in sodium carbonate (Na2CO3) and other carbonates. The name lives on as a trivial name.", "Ammonium Chloride": "Ammonium chloride is an inorganic compound with the formula NH4Cl and a white crystalline salt that is highly soluble in water. Solutions of ammonium chloride are mildly acidic. Sal ammoniac is a name of the natural, mineralogical form of ammonium chloride. The mineral is commonly formed on burning coal dumps from condensation of coal-derived gases. It is also found around some types of volcanic vents. It is mainly used as fertilizer and a flavouring agent in some types of liquorice. It is the product from the reaction of hydrochloric acid and ammonia.", "Lithium Oxide": "Lithium oxide (Li\n2O) or lithia is an inorganic chemical compound. Lithium oxide is formed along with small amounts of lithium peroxide when lithium metal is burned in the air and combines with oxygen:\n4Li + O\n2 → 2Li\n2O.\nPure Li\n2O can be produced by the thermal decomposition of lithium peroxide, Li\n2O\n2, at 450 °C\n2Li\n2O\n2 → 2Li\n2O + O\n2", "Lithium Sulfate": "Lithium sulfate is a white inorganic salt with the formula Li2SO4. It is the lithium salt of sulfuric acid.", "Magnesium Hydride": "Magnesium hydride is the chemical compound MgH2, making it an alkaline earth hydride. It contains 7.66% by weight of hydrogen and has been studied as a potential hydrogen storage medium.", "Calcium Fluoride": "Calcium fluoride is the inorganic compound with the formula CaF2. It is a white insoluble solid. It occurs as the mineral fluorite (also called fluorspar), which is often deeply coloured owing to impurities.", "Lithium Hydroxide": "Lithium hydroxide is an inorganic compound with the formula LiOH. It is a white hygroscopic crystalline material. It is soluble in water and slightly soluble in ethanol, and is available commercially in anhydrous form and as the monohydrate (LiOH.H2O), both of which are strong bases. It is the weakest base among the alkali metal hydroxides.", "Sodium Sulfate": "Sodium sulfate, also known as sulfate of soda, is the inorganic compound with formula Na2SO4 as well as several related hydrates. All forms are white solids that are highly soluble in water. With an annual production of 6 million tonnes, the decahydrate is a major commodity chemical product. It is mainly used for the manufacture of detergents and in the kraft process of paper pulping.", "Ammonium Oxide": "Ammonium oxide is not a naturally occuring compound. Theoretically, it is formed when 2 ammonium ions combine with 1 oxide ion.", "Lithium Bromide": "Lithium bromide (LiBr) is a chemical compound of lithium and bromine. Its extreme hygroscopic character makes LiBr useful as a desiccant in certain air conditioning systems.", "Sodium Chloride": "Sodium chloride /ˌsoʊdiəm ˈklɔːraɪd/, also known as salt or halite, is an ionic compound with the chemical formula NaCl, representing a 1:1 ratio of sodium and chloride ions. With molar masses of 22.99 and 35.45 g·mol−1, respectively, 100g of NaCl contain ~39.3g Na and ~60.7g Cl. Sodium chloride is the salt most responsible for the salinity of seawater and of the extracellular fluid of many multicellular organisms. In the form of edible or table salt it is commonly used as a condiment and food preservative. Large quantities of sodium chloride are used in many industrial processes, and it is a major source of sodium and chlorine compounds used as feedstocks for further chemical syntheses. A second major application of sodium chloride is de-icing of roadways in sub-freezing weather.", "Hydrogen Hydride": "Hydrogen hydride is not a naturally occuring compound. Theoretically, it is formed when 1 hydrogen ion combines with 1 hydride ion.", "Zinc Hydride": "Zinc hydride is an inorganic compound with the chemical formula ZnH2. It is a white, odourless solid which slowly decomposes into its elements at room temperature; despite this it is the most stable of the binary first row transition metal hydrides. A variety of coordination compounds containing Zn-H bonds are used as reducing agents, however ZnH2 itself has no common applications.", "Sodium Hydroxide": "Sodium hydroxide (NaOH), also known as lye and caustic soda, is an inorganic compound. It is a white solid and highly caustic metallic base and alkali of sodium which is available in pellets, flakes, granules, and as prepared solutions at different concentrations. Sodium hydroxide forms an approximately 50% (by mass) saturated solution with water.\nSodium hydroxide is soluble in water, ethanol, and methanol. This alkali is deliquescent and readily absorbs moisture and carbon dioxide in air.\nSodium hydroxide is used in many industries, mostly as a strong chemical base in the manufacture of pulp and paper, textiles, drinking water, soaps and detergents and as a drain cleaner. Worldwide production in 2004 was approximately 60 million tonnes, while demand was 51 million tonnes.", "Calcium Carbonate": "Calcium carbonate is a chemical compound with the formula CaCO3. It is a common substance found in rocks as the minerals calcite and aragonite (most notably as limestone, which contains both of those minerals) and is the main component of pearls and the shells of marine organisms, snails, and eggs. Calcium carbonate is the active ingredient in agricultural lime and is created when calcium ions in hard water react with carbonate ions to create limescale. It is medicinally used as a calcium supplement or as an antacid, but excessive consumption can be hazardous.", "Lithium Chloride": "Lithium chloride is a chemical compound with the formula LiCl. The salt is a typical ionic compound, although the small size of the Li+ ion gives rise to properties not seen for other alkali metal chlorides, such as extraordinary solubility in polar solvents (83.05 g/100 mL of water at 20 °C) and its hygroscopic properties.", "Magnesium Oxide": "Magnesium oxide (MgO), or magnesia, is a white hygroscopic solid mineral that occurs naturally as periclase and is a source of magnesium (see also oxide). It has an empirical formula of MgO and consists of a lattice of Mg2+ ions and O2− ions held together by ionic bonding. Magnesium hydroxide forms in the presence of water (MgO + H2O → Mg(OH)2), but it can be reversed by heating it to separate moisture.\nMagnesium oxide was historically known as magnesia alba (literally, the white mineral from magnesia - other sources give magnesia alba as MgCO3), to differentiate it from magnesia negra, a black mineral containing what is now known as manganese.\nWhile \"magnesium oxide\" normally refers to MgO, magnesium peroxide MgO2 is also known as a compound. According to evolutionary crystal structure prediction, MgO2 is thermodynamically stable at pressures above 116 GPa (gigapascals), and a totally new semiconducting suboxide Mg3O2 is thermodynamically stable above 500 GPa. Because of its stability, MgO is used as a model system for investigating vibrational properties of crystals.\n\n", "Calcium Nitride": "Calcium nitride is the inorganic compound with the chemical formula Ca3N2. It exists in various forms (isomorphs), α-calcium nitride being more commonly encountered.", "Hydrogen Oxide": "Hydrogen oxide is not a naturally occuring compound. Theoretically, it is formed when 2 hydrogen ions combine with 1 oxide ion.", "Aluminium Hydroxide": "Aluminium hydroxide, Al(OH)3, is found in nature as the mineral gibbsite (also known as hydrargillite) and its three much rarer polymorphs: bayerite, doyleite and nordstrandite. Aluminium hydroxide is amphoteric in nature, i.e, it has both basic and acidic nature. Closely related are aluminium oxide hydroxide, AlO(OH), and aluminium oxide (or alumina), Al2O3. Aluminium oxide is also amphoteric in nature. These compounds together are the major components of the aluminium ore bauxite.", "Calcium Sulfate": "Calcium sulfate (or calcium sulphate) is the inorganic compound with the formula CaSO4 and related hydrates. In the form of γ-anhydrite (the anhydrous form), it is used as a desiccant. One particular hydrate is better known as plaster of Paris, and another occurs naturally as the mineral gypsum. It has many uses in industry. All forms are white solids that are poorly soluble in water. Calcium sulfate causes permanent hardness in water.", "Sodium Nitride": "Sodium nitride (Na3N) is the inorganic compound with the formula Na3N. In contrast to lithium nitride and some other nitrides, sodium nitride is an extremely unstable alkali metal nitride. It can be generated by combining atomic beams of sodium and nitrogen deposited onto a low-temperature sapphire substrate. It readily decomposes into its elements:\n2 Na3N → 6 Na + N2\n^ Fischer, D., Jansen, M. (2002). \"Synthesis and structure of Na3N\". Angew Chem. 41 (10): 1755. doi:10.1002/1521-3773(20020517)41:10<1755::AID-ANIE1755>3.0.CO;2-C.  CS1 maint: Multiple names: authors list (link) Fischer, D.; Cancarevic, Z.; Schön, J. C.; Jansen, M. Z. (2004). \"Synthesis and structure of K3N\". Z. Anorg. Allg. Chem. 630 (1): 156. doi:10.1002/zaac.200300280. . 'Elusive Binary Compound Prepared' Chemical & Engineering News 80 No. 20 (20 May 2002)", "Zinc Phosphate": "Zinc phosphate (Zn3(PO4)2) is an inorganic chemical compound used as a corrosion resistant coating on metal surfaces either as part of an electroplating process or applied as a primer pigment (see also red lead). It has largely displaced toxic materials based on lead or chromium, and by 2006 it had become the most commonly used corrosion inhibitor. Zinc phosphate coats better on a crystalline structure than bare metal, so a seeding agent is often used as a pre-treatment. One common agent is sodium pyrophosphate.\nNatural forms of zinc phosphate include minerals hopeite and parahopeite, Zn3(PO4)2·4H2O. A somewhat similar mineral is natural hydrous zinc phosphate called tarbuttite, Zn2(PO4)(OH). Both are known from oxidation zones of Zn ore beds and were formed through oxidation of sphalerite by the presence of phosphate-rich solutions. The anhydrous form has not yet been found naturally.\nZinc phosphate is formed from zinc phosphate cement and used in dentistry. Zinc phosphate dental cement is one of the oldest and widely used cements, and is commonly used for luting permanent metal and zirconium dioxide restorations and as a base for dental restorations. Zinc phosphate cement is used for cementation of inlays, crowns, bridges, and orthodontic appliances and occasionally as a temporary restoration. It is prepared by mixing zinc oxide and magnesium oxide powders with a liquid consisting principally of phosphoric acid, water, and buffers. It is the standard cement to measure against. It has the longest track record of use in dentistry. It is still commonly used; however, resin-modified glass ionomer cements are more convenient and stronger when used in a dental setting.", "Calcium Oxide": "Calcium oxide (CaO), commonly known as quicklime or burnt lime, is a widely used chemical compound. It is a white, caustic, alkaline, crystalline solid at room temperature. The broadly used term \"lime\" connotes calcium-containing inorganic materials, in which carbonates, oxides and hydroxides of calcium, silicon, magnesium, aluminium, and iron predominate. By contrast, \"quicklime\" specifically applies to the single chemical compound calcium oxide. Calcium oxide that survives processing without reacting in building products such as cement is called free lime.\nQuicklime is relatively inexpensive. Both it and a chemical derivative (calcium hydroxide, of which quicklime is the base anhydride) are important commodity chemicals.", "Zinc Bromide": "Zinc bromide (ZnBr2) is an inorganic compound with the chemical formula ZnBr2. It is a colourless salt that shares many properties with zinc chloride (ZnCl2), namely a high solubility in water forming acidic solutions, and solubility in organic solvents. It is hygroscopic and forms a dihydrate ZnBr2 · 2H2O.", "Calcium Hydroxide": "Calcium hydroxide, traditionally called slaked lime, is an inorganic compound with the chemical formula Ca(OH)2. It is a colorless crystal or white powder and is obtained when calcium oxide (called lime or quicklime) is mixed, or \"slaked\" with water. It has many names including hydrated lime, caustic lime, builders' lime, slack lime, cal, or pickling lime. Calcium hydroxide is used in many applications, including food preparation. Limewater is the common name for a saturated solution of calcium hydroxide.", "Aluminium Carbonate": "Aluminium carbonate (Al2(CO3)3), is a carbonate of aluminium. It is not well characterized; one authority says that simple carbonates of aluminium, gallium and indium are not known. Basic aluminium carbonate, the mineral dawsonite, is a known compound.", "Aluminium Hydride": "Aluminium hydride (also known as alane or alumane) is an inorganic compound with the formula AlH3. It is a colourless pyrophoric solid. Although rarely encountered outside of research laboratories, alane and its derivatives are used as reducing agents in organic synthesis.", "Calcium Chloride": "Calcium chloride is an inorganic compound, a salt with the chemical formula CaCl2. It is a colorless crystalline solid at room temperature, highly soluble in water.\nCalcium chloride is commonly encountered as a hydrated solid with generic formula CaCl2(H2O)x, where x = 0, 1, 2, 4, and 6. These compounds are mainly used for deicing and dust control. Because the anhydrous salt is hygroscopic, it is used as a desiccant.", "Hydrogen Fluoride": "Hydrogen fluoride is a chemical compound with the chemical formula HF. This colorless gas or liquid is the principal industrial source of fluorine, often as an aqueous solution called hydrofluoric acid. It is an important feedstock in the preparation of many important compounds including pharmaceuticals and polymers (e.g. Teflon). HF is widely used in the petrochemical industry as a component of superacids. Hydrogen fluoride boils near room temperature, much higher than other hydrogen halides. Unlike other hydrogen halides, HF is lighter than air.\nHydrogen fluoride is a highly dangerous gas, forming corrosive and penetrating hydrofluoric acid upon contact with moisture. The gas can also cause blindness by rapid destruction of the corneas.\nFrench chemist Edmond Frémy (1814–1894) is credited with discovering anhydrous hydrogen fluoride while trying to isolate fluorine. Although Carl Wilhelm Scheele prepared hydrofluoric acid in large quantities in 1771, this acid was known in the glass industry before then.", "Aluminium Bromide": "Aluminium bromide is any chemical compound with the empirical formula AlBrx. The species called \"aluminium tribromide,\" is the most common aluminium bromide. It is a colorless, sublimable hygroscopic solid, although older samples tend to be hydrated.", "Sodium Phosphate": "Sodium phosphate is a generic term for a variety of salts of sodium (Na+) and phosphate (PO43−). Phosphate also forms families or condensed anions including di-, tri-, tetra-, and polyphosphates. Most of these salts are known in both anhydrous (water-free) and hydrated forms. The hydrates are more common than the anhydrous forms.\n\n", "Lithium Fluoride": "Lithium fluoride is an inorganic compound with the chemical formula LiF. It is a colorless solid, that transitions to white with decreasing crystal size. Although odorless, lithium fluoride has a bitter-saline taste. Its structure is analogous to that of sodium chloride, but it is much less soluble in water. It is mainly used as a component of molten salts. Formation of LiF releases one of the highest energy per mass of reactants, only second to that of BeO.", "Ammonium Sulfate": "Ammonium sulfate (American English; ammonium tetraoxosulfate (VI) is the IUPAC-recommended spelling; and ammonium sulphate in British English), (NH4)2SO4, is an inorganic salt with a number of commercial uses. The most common use is as a soil fertilizer. It contains 21% nitrogen and 24% sulfur.", "Magnesium Nitride": "Magnesium nitride, which possesses the chemical formula Mg3N2, is an inorganic compound of magnesium and nitrogen. At room temperature and pressure it is a greenish yellow powder.", "Ammonium Hydroxide": "Ammonia solution, also known as ammonia water, ammonical liquor, ammonia liquor, aqua ammonia, aqueous ammonia, or (inaccurately) ammonia, is a solution of ammonia in water. It can be denoted by the symbols NH3(aq). It is sometimes thought of as a solution of ammonium hydroxide. Although the name ammonium hydroxide suggests an alkali with composition [NH4+][OH−], it is actually impossible to isolate samples of NH4OH. The ions NH4+ and OH− do not account for a significant fraction of the total amount of ammonia except in extremely dilute solutions.", "Ammonium Fluoride": "Ammonium fluoride is the inorganic compound with the formula NH4F. It crystallizes as small colourless prisms, having a sharp saline taste, and is exceedingly soluble in water.", "Magnesium Bromide": "Magnesium bromide (MgBr2) is a chemical compound of magnesium and bromine that is white and deliquescent. It is often used as a mild sedative and as an anticonvulsant for treatment of nervous disorders. It is water-soluble and somewhat soluble in alcohol. It can be found naturally in small amounts in some minerals such as: bischofite and carnallite, and in sea water, such as that of the Dead Sea.", "Aluminium Chloride": "Aluminium chloride (AlCl3) is the main compound of aluminium and chlorine. It is white, but samples are often contaminated with iron(III) chloride, giving it a yellow colour. The solid has a low melting and boiling point. It is mainly produced and consumed in the production of aluminium metal, but large amounts are also used in other areas of chemical industry. The compound is often cited as a Lewis acid. It is an example of an inorganic compound that \"cracks\" at mild temperature, reversibly changing from a polymer to a monomer.", "Hydrogen Phosphate": "Hydrogen phosphate is not a naturally occuring compound. Theoretically, it is formed when 3 hydrogen ions combine with 1 phosphate ion.", "Aluminium Sulfate": "Aluminium sulfate is a chemical compound with the formula Al2(SO4)3. It is soluble in water and is mainly used as a flocculating agent (causing contaminating particles to clump into larger, more easily trapped particles) in the purification of drinking water and waste water treatment plants, and also in paper manufacturing.\nAluminium sulfate is sometimes referred to as a type of alum. Alums are double sulfate salts, with the formula AM(SO\n4)\n2·12H\n2O, where A is a monovalent cation such as potassium or ammonium and M is a trivalent metal ion such as aluminium. The anhydrous form occurs naturally as a rare mineral millosevichite, found e.g. in volcanic environments and on burning coal-mining waste dumps. Aluminium sulfate is rarely, if ever, encountered as the anhydrous salt. It forms a number of different hydrates, of which the hexadecahydrate Al2(SO4)3•16H2O and octadecahydrate Al2(SO4)3•18H2O are the most common. The heptadecahydrate, whose formula can be written as [Al(H2O)6]2(SO4)3•5H2O, occurs naturally as the mineral alunogen.", "Zinc Oxide": "Zinc oxide is an inorganic compound with the formula ZnO. ZnO is a white powder that is insoluble in water, and it is widely used as an additive in numerous materials and products including rubbers, plastics, ceramics, glass, cement, lubricants, paints, ointments, adhesives, sealants, pigments, foods, batteries, ferrites, fire retardants, and first-aid tapes. Although it occurs naturally as the mineral zincite, most zinc oxide is produced synthetically.\nZnO is a wide-bandgap semiconductor of the II-VI semiconductor group. The native doping of the semiconductor due to oxygen vacancies or zinc interstitials is n-type. This semiconductor has several favorable properties, including good transparency, high electron mobility, wide bandgap, and strong room-temperature luminescence. Those properties are valuable in emerging applications for: transparent electrodes in liquid crystal displays, energy-saving or heat-protecting windows, and electronics as thin-film transistors and light-emitting diodes.", "Sodium Carbonate": "Sodium carbonate (also known as washing soda, soda ash and soda crystals, and in the monohydrate form as crystal carbonate), Na2CO3, is the water-soluble sodium salt of carbonic acid.\nIt most commonly occurs as a crystalline decahydrate, which readily effloresces to form a white powder, the monohydrate. Pure sodium carbonate is a white, odorless powder that is hygroscopic (absorbs moisture from the air). It has a strongly alkaline taste, and forms a moderately basic solution in water. Sodium carbonate is well known domestically for its everyday use as a water softener. Historically it was extracted from the ashes of plants growing in sodium-rich soils, such as vegetation from the Middle East, kelp from Scotland and seaweed from Spain. Because the ashes of these sodium-rich plants were noticeably different from ashes of timber (used to create potash), they became known as \"soda ash\". It is synthetically produced in large quantities from salt (sodium chloride) and limestone by a method known as the Solvay process.\nThe manufacture of glass is one of the most important uses of sodium carbonate. Sodium carbonate acts as a flux for silica, lowering the melting point of the mixture to something achievable without special materials. This \"soda glass\" is mildly water-soluble, so some calcium carbonate is added to the melt mixture to make the glass produced insoluble. This type of glass is known as soda lime glass: \"soda\" for the sodium carbonate and \"lime\" for the calcium carbonate. Soda lime glass has been the most common form of glass for centuries.\nSodium carbonate is also used as a relatively strong base in various settings. For example, it is used as a pH regulator to maintain stable alkaline conditions necessary for the action of the majority of photographic film developing agents. It acts as an alkali because when dissolved in water, it dissociates into the weak acid: carbonic acid and the strong alkali: sodium hydroxide. This gives sodium carbonate in solution the ability to attack metals such as aluminium with the release of hydrogen gas.\nIt is a common additive in swimming pools used to raise the ph which can be lowered by chlorine tablets and other additives which contains acids.\nIn cooking, it is sometimes used in place of sodium hydroxide for lyeing, especially with German pretzels and lye rolls. These dishes are treated with a solution of an alkaline substance to change the pH of the surface of the food and improve browning.\nIn taxidermy, sodium carbonate added to boiling water will remove flesh from the skull or bones of trophies to create the \"European skull mount\" or for educational display in biological and historical studies.\nIn chemistry, it is often used as an electrolyte. Electrolytes are usually salt-based, and sodium carbonate acts as a very good conductor in the process of electrolysis. In addition, unlike chloride ions, which form chlorine gas, carbonate ions are not corrosive to the anodes. It is also used as a primary standard for acid-base titrations because it is solid and air-stable, making it easy to weigh accurately.", "Sodium Oxide": "Sodium oxide is a chemical compound with the formula Na2O. It is used in ceramics and glasses, though not in a raw form. It is the base anhydride of sodium hydroxide, so when water is added to sodium oxide NaOH is produced.\nNa2O + H2O → 2 NaOH\nThe alkali metal oxides M2O (M = Li, Na, K, Rb) crystallise in the antifluorite structure. In this motif the positions of the anions and cations are reversed relative to their positions in CaF2, with sodium ions tetrahedrally coordinated to 4 oxide ions and oxide cubically coordinated to 8 sodium ions.", "Zinc Fluoride": "Zinc fluoride (ZnF2) is an inorganic chemical compound. It is encountered as the anydrous form and also as the tetrahydrate, ZnF2 · 4H2O (rhombohedral crystal structure). It has a high melting point and has the rutile structure containing 6 coordinate zinc, which suggests appreciable ionic character in its chemical bonding. Unlike the other zinc halides, ZnCl2, ZnBr2 and ZnI2, it is not very soluble in water.", "Ammonium Nitride": "Ammonium nitride is not a naturally occuring compound. Theoretically, it is formed when 3 ammonium ions combine with 1 nitride ion.", "Ammonium Hydride": "Ammonium hydride is not a naturally occuring compound. Theoretically, it is formed when 1 ammonium ion combines with 1 hydride ion.", "Zinc Nitride": "Zinc nitride (Zn3N2) is an inorganic compound of zinc and nitrogen, usually obtained as (blue)grey crystals. It is a semiconductor. In pure form, it has the anti-bixbyite structure.", "Calcium Hydride": "Calcium hydride is the chemical compound with the formula CaH2, and is therefore an alkaline earth hydride. This grey powder (white if pure, which is rare) reacts vigorously with water liberating hydrogen gas. CaH2 is thus used as a drying agent, i.e. a desiccant.\nCaH2 is a saline hydride, meaning that its structure is salt-like. The alkali metals and the alkaline earth metals all form saline hydrides. A well-known example is sodium hydride, which crystallizes in the NaCl motif. These species are insoluble in all solvents with which they do not react. CaH2 crystallizes in the PbCl2 (cotunnite) structure.", "Zinc Sulfate": "Zinc sulfate is an inorganic compound and dietary supplement. As a supplement it is used to treat zinc deficiency and to prevention the conditions in those at high risk. Side effects may include abdominal pain, vomiting, headache, and feeling tired.\nIt has the formula ZnSO4 as well as any of three hydrates. It was historically known as \"white vitriol\". All of the various forms are colourless solids. The heptahydrate is commonly encountered.", "Aluminium Fluoride": "Aluminium fluoride (AlF3) is an inorganic compound used primarily in the production of aluminium. This colorless solid can be prepared synthetically but also occurs in nature.", "Lithium Hydride": "Lithium hydride is an inorganic compound with the formula LiH. This alkali metal hydride is a colorless solid, although commercial samples are grey. Characteristic of a salt-like, or ionic, hydride, it has a high melting point and is not soluble but reactive with all organic and protic solvents; it is soluble and non-reactive with certain molten salts such as lithium fluoride, lithium borohydride, and sodium hydride. With a molecular mass of slightly less than 8, it is the lightest ionic compound.", "Sodium Fluoride": "Sodium fluoride (NaF) is a chemical compound and medication. As a medication it is primarily used to prevent tooth decay in children older than 6 months in areas where the drinking water is low in fluoride. Sodium fluoride is used as a liquid, pill, or paste by mouth with this use being known as fluoride therapy.\nNormal doses may occasionally result in white marks on the teeth. Excessive doses can result in brown or yellow coloring of the teeth. It is believed to work mostly through direct contact with the teeth. Sodium fluoride is a colorless solid. It is most often made by mixing fluorosilicic acid with sodium hydroxide.\nSodium fluoride came into use to prevent tooth decay in the 1940s. It is on the World Health Organization's List of Essential Medicines, the most important medications needed in a basic health system. In the United Kingdom a typical month supply costs the NHS about 0.36 pounds. It is also commonly used for water fluoridation and added to toothpaste.", "Aluminium Oxide": "Aluminium oxide or Aluminum oxide (in U.S. English) is a chemical compound of aluminium and oxygen with the chemical formula Al2O3. It is the most commonly occurring of several aluminium oxides, and specifically identified as aluminium(III) oxide. It is commonly called alumina, and may also be called aloxide, aloxite, or alundum depending on particular forms or applications. It occurs naturally in its crystalline polymorphic phase α-Al2O3 as the mineral corundum, varieties of which form the precious gemstones ruby and sapphire. Al2O3 is significant in its use to produce aluminium metal, as an abrasive owing to its hardness, and as a refractory material owing to its high melting point.", "Magnesium Chloride": "Magnesium chloride is the name for the chemical compound with the formula MgCl2 and its various hydrates MgCl2(H2O)x. These salts are typical ionic halides, being highly soluble in water. The hydrated magnesium chloride can be extracted from brine or sea water. In North America, magnesium chloride is produced primarily from Great Salt Lake brine. It is extracted in a similar process from the Dead Sea in the Jordan valley. Magnesium chloride, as the natural mineral bischofite, is also extracted (via solution mining) out of ancient seabeds; for example, the Zechstein seabed in northwest Europe. Some magnesium chloride is made from solar evaporation of seawater. Anhydrous magnesium chloride is the principal precursor to magnesium metal, which is produced on a large scale. Hydrated magnesium chloride is the form most readily available.", "Lithium Phosphate": "Lithium phosphate is not a naturally occuring compound. Theoretically, it is formed when 3 lithium ions combine with 1 phosphate ion.", "Lithium Nitride": "Lithium nitride is a compound with the formula Li3N. It is the only stable alkali metal nitride. The solid is a red or purple color and has a high melting point.", "Magnesium Phosphate": "Magnesium phosphate is a general term for salts of magnesium and phosphate appearing in three forms:\nMagnesium phosphate (Mg(H2PO4)2)\nDimagnesium phosphate (MgHPO4)\nMagnesium phosphate tribasic (Mg3(PO4)2)\nAmorphous magnesium phosphate\nVarious forms have been used as laxatives and antacids."}